trade_exp/src/Documents/ОприходованиеИзлишковТоваров/ОприходованиеИзлишковТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОприходованиеИзлишковТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f7a6aa00-7209-4006-94f6-c9dff24f6c36">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b702872a-ff55-42de-874e-18cc7a282867">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2eb46e7c-716d-4be4-aa38-2fc009550c44">
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ca95b564-2edc-42ea-b560-434d30f026a6">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c60c8224-938d-4349-ba8a-1a8e21ddde83">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ИсточникиИнформацииОЦенахДляПечати/ИсточникиИнформацииОЦенахДляПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ИсточникиИнформацииОЦенахДляПечати</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПоСебестоимости</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоВидуЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыДействияВидовЦен/СтатусыДействияВидовЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДействияВидовЦен</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e2decfa9-b21b-4b8e-9bae-aa344ce05ffe">
    <name>НеДействует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИспользованиеРабочихУчастков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТекущийОтветственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НастройкаАдресногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РозничныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекущаяДолжностьОтветственного</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьОперативныеОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыРасходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПересчетовТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПриходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УчетныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСкладскиеПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияСкладскихПомещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СкладДляБухгалтерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеРазрешеноРедактированиеЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подотчетник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b6b1d28-2274-4089-bbe0-1f892b513c41">
    <name>Транзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31714690-5baf-46f1-b063-d29c311537f8">
    <name>ТорговыйЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6da19460-b28a-45da-95fc-40a81653f323">
    <name>СкрытьКоличествоУчетаВПересчетах</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="efdd8d42-ae41-4592-8382-d99891278ded">
    <name>ТипСкладаПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ad05e83-cd86-4595-b1cd-604ad5d18c31">
    <name>ДопСкладПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc9d13f0-85a3-4086-9203-6e34b242f14b">
    <name>ОтправкаУведомлений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3d49e10-572c-4e29-a20e-727c92be2a9e">
    <name>ПовторноеУведомление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57e1c5a7-2f3b-451e-b301-5b891fe6cb38">
    <name>ТелефонПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="682997ea-3be2-4a30-8770-7535fef1dbdd">
    <name>EMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6500dc86-8583-4657-936f-1ccc78a87015">
    <name>ДопEMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93e0d2a6-ba2b-4dd6-9aa3-ef4cbd740848">
    <name>УведомлятьВБитриксОПоступлениях</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d5793ec-4952-45ae-ba13-3ea772eca4ae">
    <name>УведомлятьВБитриксОСписанииПодотчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2354dc18-0c64-42c5-8971-6e5307b195f6">
    <name>ИндивидуальныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Documents/ОприходованиеИзлишковТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПодстановкаДанных()
	
   Если ЗначениеЗаполнено(Объект.Склад) Тогда 
   	
    	Объект.Подразделение = Объект.Склад.Подразделение;
    	Объект.АналитикаДоходов = Объект.Склад.Подразделение;
    	
    КонецЕсли;
    
КонецПроцедуры





&НаСервере
&ИзменениеИКонтроль("ЗаполнитьЦеныПоСебестоимостиСервер")
Функция Док_ЗаполнитьЦеныПоСебестоимостиСервер(БезНДС)

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
	
	#Удаление
		ЗапросПредварительныхДанных = Новый Запрос;
		ЗапросПредварительныхДанных.Текст =  
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РасчетСебестоимостиТоваровОрганизации.Ссылка) КАК Количество
		|ИЗ
		|	Документ.РасчетСебестоимостиТоваров.Организации КАК РасчетСебестоимостиТоваровОрганизации
		|ГДЕ
		|	РасчетСебестоимостиТоваровОрганизации.Ссылка.Проведен
		|	И РасчетСебестоимостиТоваровОрганизации.Ссылка.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
		|	И РасчетСебестоимостиТоваровОрганизации.Организация = &Организация";

		ЗапросПредварительныхДанных.УстановитьПараметр("Организация", Объект.Организация);
		ПредварительныеДанные = ЗапросПредварительныхДанных.Выполнить().Выбрать();

		Пока ПредварительныеДанные.Следующий() Цикл
			Если ПредварительныеДанные.Количество = 0 Тогда
				ТекстСообщения = НСтр("ru = 'Не было произведено ни одного расчета себестоимости товаров по организации ""%Организация%"".'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Организация%", Объект.Организация);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	#КонецУдаления

	ДругиеИменаКолонок = Новый Структура("Номенклатура, Характеристика", "Номенклатура", "Характеристика");

	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
	ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
	ПараметрыЗаполнения.Вставить("Валюта", Объект.Валюта);
	ПараметрыЗаполнения.Вставить("Склад", Объект.Склад);
	ПараметрыЗаполнения.Вставить("ДругиеИменаКолонок", ДругиеИменаКолонок);
	ПараметрыЗаполнения.Вставить("БезНДС", БезНДС);

	Возврат ПродажиСервер.ЗаполнитьЦеныПоСебестоимости(
	Объект.Товары, // Табличная часть
	Неопределено, // Выделенные строки (заполнять во всех строках)
	ПараметрыЗаполнения,
	СтруктураДействий);

КонецФункции

#Область Зеленение
&После("УстановитьУсловноеОформление")
Процедура Спр_УстановитьУсловноеОформление()
	АльтерраОбщегоНазначения.УстановитьОформлениеЗеленениеСтрокТабличныхЧастей(ЭтаФорма,"Товары");
КонецПроцедуры

&НаСервере
Процедура СКПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ИсключитьИзКонтроля.Доступность= РольДоступна("РазрешитьИсключатьДокументыИзКонтроляОрдерногоУчета");
	
	УстановитьВидимостьВидЦены(Объект.ИсточникИнформацииОЦенахДляПечати);
	
	ЭтаФорма.Элементы._ГруппаСекции.Видимость=рольДоступна("ПолныеПрава") или рольДоступна("СнятьЗеленение");
	НастройкаОтображенияКомандыСозданияОрдеров();
		
	Если Объект.ИсточникИнформацииОЦенахДляПечати.Пустая() Тогда
		Объект.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости;
		Элементы.ВидЦены.Видимость = Ложь;
		ИсточникИнформацииОЦенахДляПечати = Объект.ИсточникИнформацииОЦенахДляПечати;
		ЗаполнитьЦеныПоИсточникИнформацииОЦенахДляПечати(ИсточникИнформацииОЦенахДляПечати);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СКСброситьПоСекции(Команда)
	МассивВыдСтрок=Элементы.Товары.ВыделенныеСтроки;
	если МассивВыдСтрок.Количество()<>0 тогда
		
		Для Каждого ТекСтрока Из МассивВыдСтрок Цикл
			Объект.Товары.НайтиПоИдентификатору(ТекСтрока).Кладовщик="";
		конеццикла;
	конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура СКТоварыПередУдалением(Элемент, Отказ)
		если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Удаление строки запрещено!!!");
		Отказ=Истина;
	конецесли;	

КонецПроцедуры

&НаКлиенте
Процедура СКТоварыПередНачаломИзменения(Элемент, Отказ)
		если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Удаление строки запрещено!!!");
		Отказ=Истина;
	конецесли;	

КонецПроцедуры

#КонецОбласти

#Область Доработки_по_ордерной_схеме

&НаСервере
Процедура НастройкаОтображенияКомандыСозданияОрдеров()
	
	ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач = 
	СкладыСервер.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач(Объект.Склад, Объект.Дата); 
	
	Если ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
		ЭтаФорма.Элементы.Форма_СоздатьОрдера.Видимость = ?(ЗначениеЗаполнено(Объект.ПересчетТоваров) Или ЗначениеЗаполнено(Объект.ДокументОснование) ИЛИ ЗначениеЗаполнено(Объект.Основание),Ложь,Истина);
	Иначе
		ЭтаФорма.Элементы.Форма_СоздатьОрдера.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Док__СоздатьОрдераПослеНаСервере()
	Альтерра_СкладСервер.СоздатьОрдераПоАктам(Объект.Ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура Док__СоздатьОрдераПосле(Команда)
	Док__СоздатьОрдераПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Док_СкладПриИзмененииПосле(Элемент)
	НастройкаОтображенияКомандыСозданияОрдеров();
	ПодстановкаДанных()
	
	
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ДатаПриИзмененииПосле(Элемент)
	НастройкаОтображенияКомандыСозданияОрдеров();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьИзФайла_Альтерра(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла", ЭтотОбъект);
	ПараметрыФормы= Новый Структура();
	ПараметрыФормы.Вставить("НастройкиТаблицы",СтруктураТаблицы());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Функция СтруктураТаблицы()
	
	СтруктураТаблицы=Новый Структура();
	
	СтруктураТаблицы.Вставить("Код","строка#Код#15#1#Справочники.Номенклатура.НайтиПоКоду(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Номенклатура","СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Характеристика","строка#Характеристика#20");
	СтруктураТаблицы.Вставить("Количество","число#Количество#15");
	СтруктураТаблицы.Вставить("Цена","число#Цена#10");
	СтруктураТаблицы.Вставить("Сумма","число#Сумма#10");

	возврат  СтруктураТаблицы;
КонецФункции 

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры) Экспорт
	
	ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры)
	
	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		
		Если ТаблицаДанных<>Неопределено Тогда
			Объект.Товары.Загрузить(ТаблицаДанных);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	НовыйМассив = Новый Массив();
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", ПредопределенноеЗначение("Перечисление.СтатусыДействияВидовЦен.Действует"));
	НовыйМассив.Добавить(НовыйПараметр);
	НовыйПараметр2 = Новый ПараметрВыбора("Отбор.ИспользоватьПриПродаже", Ложь);
	НовыйМассив.Добавить(НовыйПараметр2);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ВидЦены.ПараметрыВыбора = НовыеПараметры;  
	
	Если ЗначениеЗаполнено(Объект.СтатьяДоходов) И Не ЗначениеЗаполнено(Объект.АналитикаДоходов) И Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДоходыИРасходыКлиентСервер.СтатьяПриИзменении(ЭтотОбъект, Элементы.СтатьяДоходов);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;  
	
	Если Параметры.Свойство("Организация") Тогда 
		Объект.Организация = Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("Склад") Тогда 
		Объект.Склад = Параметры.Склад;
	КонецЕсли;
	
	Если Параметры.Свойство("Комментарий") Тогда 
		Объект.Комментарий = Параметры.Комментарий;
	КонецЕсли;
	
	Если Параметры.Свойство("СтатьяДоходов") Тогда 
		Объект.СтатьяДоходов = Параметры.СтатьяДоходов;
	КонецЕсли;
	
	Если Параметры.Свойство("Товары") И ЭтоАдресВременногоХранилища(Параметры.Товары) Тогда 
		Объект.Товары.Загрузить(ПолучитьИзВременногоХранилища(Параметры.Товары));
		УдалитьИзВременногоХранилища(Параметры.Товары);
	КонецЕсли;      
	
	Если ЗначениеЗаполнено(Объект.Подразделение) И Не ЗначениеЗаполнено(Объект.ВидЦены) И Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВидЦены = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Подразделение, "ЦенаЗакупа").ЦенаЗакупа;                                           
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура Док_ИсточникИнформацииОЦенахДляПечатиПриИзмененииПослеНаСервере()
	ИсточникИнформацииОЦенахДляПечати = Объект.ИсточникИнформацииОЦенахДляПечати;
	УстановитьВидимостьВидЦены(ИсточникИнформацииОЦенахДляПечати);
	УстановитьЗначениеВидЦены(ИсточникИнформацииОЦенахДляПечати);
	ЗаполнитьЦеныПоИсточникИнформацииОЦенахДляПечати(ИсточникИнформацииОЦенахДляПечати);
КонецПроцедуры


&НаКлиенте
Процедура Док_ИсточникИнформацииОЦенахДляПечатиПриИзмененииПосле(Элемент)
	Док_ИсточникИнформацииОЦенахДляПечатиПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеВидЦены(ИсточникИнформацииОЦенахДляПечати)
	
	Если ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен Тогда
		Объект.ВидЦены = Справочники.Склады.УчетныйВидЦены(Объект.Склад);
	ИначеЕсли ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости 
		или ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоЦенамПоставщиков Тогда
		Объект.ВидЦены = Неопределено;     
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВидЦены(ИсточникИнформацииОЦенахДляПечати)
	
	Если ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен Тогда
		Элементы.ВидЦены.Доступность = Истина; 
		Элементы.ВидЦены.Видимость = истина; 
	ИначеЕсли ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости или
		ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоЦенамПоставщиков  Тогда
		Элементы.ВидЦены.Видимость = Ложь; 
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьЦеныПоИсточникИнформацииОЦенахДляПечати(ИсточникИнформацииОЦенахДляПечати)
	Если ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен Тогда
		ЗаполнитьЦеныПоВидуЦенСервер();
	ИначеЕсли ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости Тогда
		ЗаполнитьЦеныПоСебестоимостиСервер(Ложь); 
	ИначеЕсли ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоЦенамПоставщиков Тогда
		ЗаполнитьЦеныПоЦенамПоставщиковСервер(); 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЦеныПоЦенамПоставщиковСервер()
 	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
	ДругиеИменаКолонок = Новый Структура("Номенклатура", "Номенклатура");
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
 	ПараметрыЗаполнения.Вставить("ДругиеИменаКолонок", ДругиеИменаКолонок);
 	ПараметрыЗаполнения.Вставить("Регион", Объект.Склад.Подразделение.РегионПрисутствия);
	Возврат ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦеныПоЦенамПоставщиков(
		Объект.Товары, // Табличная часть
		неопределено, // Выделенные строки (заполнять во всех строках)
		ПараметрыЗаполнения,
		СтруктураДействий);

	

КонецФункции // ()

&НаКлиенте
Процедура Док_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	ПроверкаЗаполненияВидаЦены();
КонецПроцедуры 

&НаСервере
Процедура ПроверкаЗаполненияВидаЦены()

	Если Не ЗначениеЗаполнено(Объект.ВидЦены) И Объект.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен Тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните вид цены!",,"ВидЦены");
		Возврат;
	КонецЕсли;	

КонецПроцедуры 

&НаКлиенте
Процедура Док_ТоварыНоменклатураПриИзмененииВместо(Элемент)    
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика); 
	
	Если Объект.ИсточникИнформацииОЦенахДляПечати = предопределенноезначение("Перечисление.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен") Тогда
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", Новый Структура("Дата, Валюта, ВидЦены", Объект.Дата, Объект.Валюта, Объект.ВидЦены));
	
	СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
	СтруктураДействий.Вставить("ЗаполнитьПризнакВедетсяУчетПоГТД", Новый Структура("Номенклатура", "ВедетсяУчетПоГТД"));
	СтруктураДействий.Вставить("ЗаполнитьСтрануПроисхожденияНоменклатуры",
								ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтраныПроисхождения());
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначение");
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));
	
	УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ДополнитьОписаниеНастроекЗаполненияСлужебныхРеквизитовТабличнойЧасти(СтруктураДействий);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

	Иначеесли Объект.ИсточникИнформацииОЦенахДляПечати = предопределенноезначение("Перечисление.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости") тогда
		ЗаполнитьЦеныПоСебестоимостиСервер(Ложь); 	   
	Иначеесли Объект.ИсточникИнформацииОЦенахДляПечати = предопределенноезначение("Перечисление.ИсточникиИнформацииОЦенахДляПечати.ПоЦенамПоставщиков") тогда
		ЗаполнитьЦеныПоЦенамПоставщиковСервер();
	КонецЕсли;
	
	Если Не ТекущаяСтрока.ВедетсяУчетПоГТД Тогда
		ТекущаяСтрока.НомерГТД = Неопределено;
		ТекущаяСтрока.ТипНомераГТД = Неопределено;
		ТекущаяСтрока.СтранаПроисхождения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыХарактеристикаПриИзмененииВместо(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;           
	
	Если Объект.ИсточникИнформацииОЦенахДляПечати = предопределенноезначение("Перечисление.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен") Тогда
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", Новый Структура("Дата, Валюта, ВидЦены", Объект.Дата, Объект.Валюта, Объект.ВидЦены));
	
	СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначение");
	
	СтруктураДействий.Вставить("ХарактеристикаПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);   

	ИначеЕсли Объект.ИсточникИнформацииОЦенахДляПечати = ПредопределенноеЗначение("Перечисление.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости") тогда
	//	ЗаполнитьЦеныПоСебестоимостиСервер(Истина); //При тестировании надо подставлять нужный передаваемый параметр. Поставлена заглушка, для избежания ошибки
		ПересчитатьСтрокуПоСебестоимостиСервер(ТекущаяСтрока.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПересчитатьСтрокуПоСебестоимостиСервер(ТекущаяСтрока = Неопределено);

	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока));
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
	ДругиеИменаКолонок = Новый Структура("Номенклатура, Характеристика", "Номенклатура", "Характеристика");
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
	ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
	ПараметрыЗаполнения.Вставить("Валюта", Объект.Валюта);
	ПараметрыЗаполнения.Вставить("Склад", Объект.Склад);
	ПараметрыЗаполнения.Вставить("ДругиеИменаКолонок", ДругиеИменаКолонок);
	Возврат ПродажиСервер.ЗаполнитьЦеныПоСебестоимости(
		Объект.Товары, // Табличная часть
		МассивСтрок, // Выделенные строки (заполнять во всех строках)
		ПараметрыЗаполнения, СтруктураДействий);

КонецФункции
